Autodesk.Revit.DB.Structure.RebarShape.GetParamsDefinedByCrankStraightLengthFormulas(System.Int32)
Gets the shared parameters that are defined as forumulas that are equal to crank straight length .
Returns:
Returns the shared parameters that are defined as forumulas that are equal to crank straight length  at the specified end.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamsDefinedByCrankOffsetLengthFormulas(System.Int32)
Gets the shared parameters that are defined as forumulas that are equal to crank offset length .
Returns:
Returns the shared parameters that are defined as forumulas that are equal to crank offset length  at the specified end.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamsDefinedByCrankAngledLengthFormulas(System.Int32)
Gets the shared parameters that are defined as forumulas that are equal to crank angled length .
Returns:
Returns the shared parameters that are defined as forumulas that are equal to crank angled length  at the specified end.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamsDefinedByCrankLengthFormulas(System.Int32)
Gets the shared parameters that are defined as forumulas that are equal to crank length at the specified end.
Returns:
Returns the shared parameters that are defined as forumulas that are equal to crank length at the specified end.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.RebarShapeMatchesCurvesAndTerminationsData(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarShapeTerminationsData)
Checks if rebarShape matches curves and terminations data.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information.
If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, then this method will ignore the end treatment information.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends, hooks and cranks should not be included in the array of curves.
rebarShapeTerminationsData:
Data about the Rebar Shape's terminations.
Returns:
True if rebarShape matches curves and termination data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
The rebarShapeTerminationsData was not created using the rebarShape's document.
-or-
The rebarShapeTerminationsData was not created using the barType's document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShape.IsSameShapeIgnoringTerminations(Autodesk.Revit.DB.Structure.RebarShape)
Test whether two shapes have equivalent definitions by comparing
the RebarShapeDefinition and MultiplanarDefinition properties.
Remarks:
This method will return true if the definitions are exactly equivalent.
The hooks, cranks, end treatments, orientations and terminations' rotation angles are ignored.
otherShape:
Another shape to be compared to this one.
Returns:
True if the shape definitions match, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarShape.GetTerminationsData
Gets the terminations (e.g. hook, crank) data.
Returns:
Returns the terminations (e.g. hook, crank) data.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarShapeTerminationsData)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
rebarShapeTerminationsData:
Data about Rebar Shape terminations.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
-or-
The rebarShapeTerminationsData was not created using the input document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarShape.HasCrankAtEnd
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.HasCrankAtStart
Since:
2009